name: "retina_mobile"
layer {
  name: "data"
  threshold_y: 255.001235962
  blob_param {
    name: "data"
    threshold_y: 255.001235962
  }
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv0"
  threshold_y: 3.14453005791
  threshold_x_quantized: 0
  threshold_x_quantized: 1289651253
  threshold_x_quantized: 0
  threshold_x_quantized: 1812027219
  threshold_x_quantized: 1157390687
  threshold_x_quantized: 1086659965
  threshold_x_quantized: 0
  threshold_x_quantized: 1429178860
  blob_param {
    name: "mobilenet0_batchnorm0"
    threshold_y: 3.14453005791
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 0
  right_shift_array: 10
  right_shift_array: 0
  right_shift_array: 11
  right_shift_array: 7
  right_shift_array: 22
  right_shift_array: 0
  right_shift_array: 10
}
layer {
  name: "mobilenet0_relu0"
  threshold_y: 3.14453005791
  blob_param {
    name: "mobilenet0_batchnorm0"
    threshold_y: 3.14453005791
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv1"
  threshold_y: 2.90646862984
  threshold_x_quantized: 0
  threshold_x_quantized: 1631438465
  threshold_x_quantized: 0
  threshold_x_quantized: 1197361964
  threshold_x_quantized: 1399245547
  threshold_x_quantized: 1689468449
  threshold_x_quantized: 0
  threshold_x_quantized: 1492373925
  blob_param {
    name: "mobilenet0_batchnorm1"
    threshold_y: 2.90646862984
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 0
  right_shift_array: 7
  right_shift_array: 0
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 25
  right_shift_array: 0
  right_shift_array: 7
}
layer {
  name: "mobilenet0_relu1"
  threshold_y: 2.90646862984
  blob_param {
    name: "mobilenet0_batchnorm1"
    threshold_y: 2.90646862984
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv2"
  threshold_y: 3.98850440979
  threshold_x_quantized: 1594646827
  threshold_x_quantized: 1724679908
  threshold_x_quantized: 1379028283
  threshold_x_quantized: 1378420689
  threshold_x_quantized: 1175464887
  threshold_x_quantized: 1859348013
  threshold_x_quantized: 1729766010
  threshold_x_quantized: 1260687604
  threshold_x_quantized: 2141672029
  threshold_x_quantized: 1315175162
  threshold_x_quantized: 1682514918
  threshold_x_quantized: 1075163884
  threshold_x_quantized: 1255611668
  threshold_x_quantized: 1490449632
  threshold_x_quantized: 1722265576
  threshold_x_quantized: 2004374314
  blob_param {
    name: "mobilenet0_batchnorm2"
    threshold_y: 3.98850440979
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 5
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 6
}
layer {
  name: "mobilenet0_relu2"
  threshold_y: 3.98850440979
  blob_param {
    name: "mobilenet0_batchnorm2"
    threshold_y: 3.98850440979
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv3"
  threshold_y: 2.98855805397
  threshold_x_quantized: 1114119185
  threshold_x_quantized: 2033567027
  threshold_x_quantized: 2061983535
  threshold_x_quantized: 2031216779
  threshold_x_quantized: 1205805754
  threshold_x_quantized: 1573030350
  threshold_x_quantized: 1451569107
  threshold_x_quantized: 1404817744
  threshold_x_quantized: 1633531209
  threshold_x_quantized: 2075168873
  threshold_x_quantized: 1124794636
  threshold_x_quantized: 1591108023
  threshold_x_quantized: 1636426739
  threshold_x_quantized: 1234889601
  threshold_x_quantized: 1913216163
  threshold_x_quantized: 1432626020
  blob_param {
    name: "mobilenet0_batchnorm3"
    threshold_y: 2.98855805397
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 4
  right_shift_array: 5
  right_shift_array: 5
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 5
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 4
  right_shift_array: 5
  right_shift_array: 6
  right_shift_array: 4
  right_shift_array: 6
  right_shift_array: 5
  right_shift_array: 4
  right_shift_array: 8
}
layer {
  name: "mobilenet0_relu3"
  threshold_y: 2.98855805397
  blob_param {
    name: "mobilenet0_batchnorm3"
    threshold_y: 2.98855805397
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv4"
  threshold_y: 2.69810152054
  threshold_x_quantized: 1139968269
  threshold_x_quantized: 1638274086
  threshold_x_quantized: 1075467325
  threshold_x_quantized: 2006989488
  threshold_x_quantized: 1288531897
  threshold_x_quantized: 1905631905
  threshold_x_quantized: 1341877703
  threshold_x_quantized: 1105684715
  threshold_x_quantized: 2050171264
  threshold_x_quantized: 1334459658
  threshold_x_quantized: 1222674478
  threshold_x_quantized: 2040042964
  threshold_x_quantized: 1385775607
  threshold_x_quantized: 1379168825
  threshold_x_quantized: 1487966003
  threshold_x_quantized: 0
  threshold_x_quantized: 1268338955
  threshold_x_quantized: 1605441645
  threshold_x_quantized: 1810321642
  threshold_x_quantized: 1175669051
  threshold_x_quantized: 1299819103
  threshold_x_quantized: 1226781546
  threshold_x_quantized: 1621186114
  threshold_x_quantized: 1578006606
  threshold_x_quantized: 1118163081
  threshold_x_quantized: 1183889071
  threshold_x_quantized: 1499040540
  threshold_x_quantized: 1507543764
  threshold_x_quantized: 1434826628
  threshold_x_quantized: 1329300020
  threshold_x_quantized: 1958027646
  threshold_x_quantized: 1506231312
  blob_param {
    name: "mobilenet0_batchnorm4"
    threshold_y: 2.69810152054
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 0
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
}
layer {
  name: "mobilenet0_relu4"
  threshold_y: 2.69810152054
  blob_param {
    name: "mobilenet0_batchnorm4"
    threshold_y: 2.69810152054
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv5"
  threshold_y: 3.59886312485
  threshold_x_quantized: 1740244368
  threshold_x_quantized: 1354776565
  threshold_x_quantized: 1985023984
  threshold_x_quantized: 2134197202
  threshold_x_quantized: 1714103525
  threshold_x_quantized: 1807809475
  threshold_x_quantized: 2065396095
  threshold_x_quantized: 2043633266
  threshold_x_quantized: 1653942140
  threshold_x_quantized: 1538965171
  threshold_x_quantized: 1916970235
  threshold_x_quantized: 1544757006
  threshold_x_quantized: 1733578984
  threshold_x_quantized: 1447326163
  threshold_x_quantized: 1981336517
  threshold_x_quantized: 0
  threshold_x_quantized: 1771325185
  threshold_x_quantized: 1604854959
  threshold_x_quantized: 1239893639
  threshold_x_quantized: 1174833737
  threshold_x_quantized: 1116507642
  threshold_x_quantized: 2065069245
  threshold_x_quantized: 1739698532
  threshold_x_quantized: 1559591704
  threshold_x_quantized: 1735620880
  threshold_x_quantized: 1934128576
  threshold_x_quantized: 1374132646
  threshold_x_quantized: 1119292866
  threshold_x_quantized: 2077722901
  threshold_x_quantized: 1250771407
  threshold_x_quantized: 1108535244
  threshold_x_quantized: 1395728979
  blob_param {
    name: "mobilenet0_batchnorm5"
    threshold_y: 3.59886312485
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 5
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 0
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 5
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 5
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 5
  right_shift_array: 8
}
layer {
  name: "mobilenet0_relu5"
  threshold_y: 3.59886312485
  blob_param {
    name: "mobilenet0_batchnorm5"
    threshold_y: 3.59886312485
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv6"
  threshold_y: 3.10409879684
  threshold_x_quantized: 1272489153
  threshold_x_quantized: 1201643373
  threshold_x_quantized: 1234179621
  threshold_x_quantized: 1875926128
  threshold_x_quantized: 1944992866
  threshold_x_quantized: 1186686602
  threshold_x_quantized: 1718182961
  threshold_x_quantized: 1690586124
  threshold_x_quantized: 1408769236
  threshold_x_quantized: 1380823951
  threshold_x_quantized: 1364543658
  threshold_x_quantized: 1685956130
  threshold_x_quantized: 1481902040
  threshold_x_quantized: 1280184242
  threshold_x_quantized: 1492184369
  threshold_x_quantized: 1475849316
  threshold_x_quantized: 1198784185
  threshold_x_quantized: 1587702132
  threshold_x_quantized: 1363630392
  threshold_x_quantized: 1614470588
  threshold_x_quantized: 1673566344
  threshold_x_quantized: 1730205155
  threshold_x_quantized: 1209261367
  threshold_x_quantized: 1880614444
  threshold_x_quantized: 1301999337
  threshold_x_quantized: 1591424944
  threshold_x_quantized: 1660859125
  threshold_x_quantized: 2140837654
  threshold_x_quantized: 1733560673
  threshold_x_quantized: 1690677095
  threshold_x_quantized: 1786708921
  threshold_x_quantized: 1749087826
  blob_param {
    name: "mobilenet0_batchnorm6"
    threshold_y: 3.10409879684
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 26
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
}
layer {
  name: "mobilenet0_relu6"
  threshold_y: 3.10409879684
  blob_param {
    name: "mobilenet0_batchnorm6"
    threshold_y: 3.10409879684
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv7"
  threshold_y: 2.20578694344
  threshold_x_quantized: 1385150489
  threshold_x_quantized: 1301473420
  threshold_x_quantized: 1382004639
  threshold_x_quantized: 1454268329
  threshold_x_quantized: 1353693334
  threshold_x_quantized: 1678720616
  threshold_x_quantized: 1204379044
  threshold_x_quantized: 1140140790
  threshold_x_quantized: 2142063374
  threshold_x_quantized: 1241328041
  threshold_x_quantized: 1857088519
  threshold_x_quantized: 1460600829
  threshold_x_quantized: 1594203338
  threshold_x_quantized: 2122902586
  threshold_x_quantized: 1312084057
  threshold_x_quantized: 1997933537
  threshold_x_quantized: 1212740149
  threshold_x_quantized: 1183413551
  threshold_x_quantized: 1182474723
  threshold_x_quantized: 1177913874
  threshold_x_quantized: 1207210931
  threshold_x_quantized: 1638436543
  threshold_x_quantized: 1765656837
  threshold_x_quantized: 1855684960
  threshold_x_quantized: 1237770958
  threshold_x_quantized: 1848659776
  threshold_x_quantized: 1836431766
  threshold_x_quantized: 1410031791
  threshold_x_quantized: 1568045647
  threshold_x_quantized: 1587268579
  threshold_x_quantized: 1216783669
  threshold_x_quantized: 1586618676
  blob_param {
    name: "mobilenet0_batchnorm7"
    threshold_y: 2.20578694344
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 5
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 5
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 21
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
}
layer {
  name: "mobilenet0_relu7"
  threshold_y: 2.20578694344
  blob_param {
    name: "mobilenet0_batchnorm7"
    threshold_y: 2.20578694344
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv8"
  threshold_y: 0.948010385036
  threshold_x_quantized: 1528299877
  threshold_x_quantized: 1175319831
  threshold_x_quantized: 1799306631
  threshold_x_quantized: 1145087293
  threshold_x_quantized: 1683109951
  threshold_x_quantized: 1844050892
  threshold_x_quantized: 1156745112
  threshold_x_quantized: 1138423990
  threshold_x_quantized: 1980019842
  threshold_x_quantized: 1576668513
  threshold_x_quantized: 1155483304
  threshold_x_quantized: 1169857581
  threshold_x_quantized: 1978311074
  threshold_x_quantized: 1147979243
  threshold_x_quantized: 1770329199
  threshold_x_quantized: 1468669454
  threshold_x_quantized: 1570639056
  threshold_x_quantized: 1180475322
  threshold_x_quantized: 1099825040
  threshold_x_quantized: 1340108143
  threshold_x_quantized: 1585105435
  threshold_x_quantized: 1472979570
  threshold_x_quantized: 1141909356
  threshold_x_quantized: 1128128942
  threshold_x_quantized: 1308799788
  threshold_x_quantized: 1075233000
  threshold_x_quantized: 1374590414
  threshold_x_quantized: 1647923325
  threshold_x_quantized: 1589935106
  threshold_x_quantized: 1366486907
  threshold_x_quantized: 1712795758
  threshold_x_quantized: 1200085056
  threshold_x_quantized: 1859098028
  threshold_x_quantized: 1295606460
  threshold_x_quantized: 2119129948
  threshold_x_quantized: 1214529545
  threshold_x_quantized: 1408938068
  threshold_x_quantized: 1317585462
  threshold_x_quantized: 1397491927
  threshold_x_quantized: 1144817389
  threshold_x_quantized: 1311025282
  threshold_x_quantized: 1369664843
  threshold_x_quantized: 1953850152
  threshold_x_quantized: 1728780297
  threshold_x_quantized: 1867516336
  threshold_x_quantized: 1544502573
  threshold_x_quantized: 2029855264
  threshold_x_quantized: 2013493530
  threshold_x_quantized: 1740884332
  threshold_x_quantized: 2010372627
  threshold_x_quantized: 1216851310
  threshold_x_quantized: 1286966571
  threshold_x_quantized: 1309676732
  threshold_x_quantized: 1953489188
  threshold_x_quantized: 1155954611
  threshold_x_quantized: 2136226267
  threshold_x_quantized: 1454651896
  threshold_x_quantized: 1208733507
  threshold_x_quantized: 1641471702
  threshold_x_quantized: 1556600353
  threshold_x_quantized: 1242007206
  threshold_x_quantized: 1744241857
  threshold_x_quantized: 1363328775
  threshold_x_quantized: 1800268604
  blob_param {
    name: "mobilenet0_batchnorm8"
    threshold_y: 0.948010385036
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 5
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 5
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
}
layer {
  name: "mobilenet0_relu8"
  threshold_y: 0.948010385036
  blob_param {
    name: "mobilenet0_batchnorm8"
    threshold_y: 0.948010385036
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv9"
  threshold_y: 2.09808111191
  threshold_x_quantized: 1298675536
  threshold_x_quantized: 1763040258
  threshold_x_quantized: 1640314208
  threshold_x_quantized: 1274331180
  threshold_x_quantized: 1690274741
  threshold_x_quantized: 1442110002
  threshold_x_quantized: 1090134819
  threshold_x_quantized: 1615996226
  threshold_x_quantized: 1599810032
  threshold_x_quantized: 1126398203
  threshold_x_quantized: 1666298572
  threshold_x_quantized: 1080193215
  threshold_x_quantized: 1292789069
  threshold_x_quantized: 1384694365
  threshold_x_quantized: 1180849959
  threshold_x_quantized: 1534778854
  threshold_x_quantized: 1591931566
  threshold_x_quantized: 1281202021
  threshold_x_quantized: 1826861270
  threshold_x_quantized: 2114876634
  threshold_x_quantized: 1555252802
  threshold_x_quantized: 1891526691
  threshold_x_quantized: 1943231337
  threshold_x_quantized: 1325931604
  threshold_x_quantized: 1355558268
  threshold_x_quantized: 1600818930
  threshold_x_quantized: 1846825911
  threshold_x_quantized: 1551324789
  threshold_x_quantized: 1297323553
  threshold_x_quantized: 1956291708
  threshold_x_quantized: 1401244118
  threshold_x_quantized: 1789615362
  threshold_x_quantized: 1671974745
  threshold_x_quantized: 2122535322
  threshold_x_quantized: 1232400528
  threshold_x_quantized: 1539244050
  threshold_x_quantized: 1443240355
  threshold_x_quantized: 1739845342
  threshold_x_quantized: 1441944243
  threshold_x_quantized: 1262372591
  threshold_x_quantized: 2003858857
  threshold_x_quantized: 1411402376
  threshold_x_quantized: 2090243906
  threshold_x_quantized: 1814811647
  threshold_x_quantized: 1781925095
  threshold_x_quantized: 1371213871
  threshold_x_quantized: 1271599107
  threshold_x_quantized: 1557203043
  threshold_x_quantized: 1318106810
  threshold_x_quantized: 1512949800
  threshold_x_quantized: 1945070533
  threshold_x_quantized: 1643397811
  threshold_x_quantized: 1823037478
  threshold_x_quantized: 1139118843
  threshold_x_quantized: 1108442565
  threshold_x_quantized: 1829543719
  threshold_x_quantized: 1949780724
  threshold_x_quantized: 1784330161
  threshold_x_quantized: 1435394278
  threshold_x_quantized: 1170985393
  threshold_x_quantized: 2136428767
  threshold_x_quantized: 1492612114
  threshold_x_quantized: 1751024065
  threshold_x_quantized: 1438910496
  blob_param {
    name: "mobilenet0_batchnorm9"
    threshold_y: 2.09808111191
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 5
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 5
  right_shift_array: 5
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 5
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
}
layer {
  name: "mobilenet0_relu9"
  threshold_y: 2.09808111191
  blob_param {
    name: "mobilenet0_batchnorm9"
    threshold_y: 2.09808111191
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv10"
  threshold_y: 1.19256234169
  threshold_x_quantized: 1179884750
  threshold_x_quantized: 1529204619
  threshold_x_quantized: 1477360006
  threshold_x_quantized: 1225208731
  threshold_x_quantized: 1550028262
  threshold_x_quantized: 1384944859
  threshold_x_quantized: 1412848734
  threshold_x_quantized: 1082371390
  threshold_x_quantized: 1248379315
  threshold_x_quantized: 1974119670
  threshold_x_quantized: 1500469338
  threshold_x_quantized: 1284026047
  threshold_x_quantized: 1938772330
  threshold_x_quantized: 1248047496
  threshold_x_quantized: 1483726833
  threshold_x_quantized: 2047768858
  threshold_x_quantized: 1321948334
  threshold_x_quantized: 1427318273
  threshold_x_quantized: 1583173684
  threshold_x_quantized: 1309223125
  threshold_x_quantized: 1957227638
  threshold_x_quantized: 1284560538
  threshold_x_quantized: 1359459874
  threshold_x_quantized: 1329412292
  threshold_x_quantized: 1850302530
  threshold_x_quantized: 1999083676
  threshold_x_quantized: 1278533299
  threshold_x_quantized: 2089405560
  threshold_x_quantized: 1953322150
  threshold_x_quantized: 1260549991
  threshold_x_quantized: 1138880272
  threshold_x_quantized: 1530920462
  threshold_x_quantized: 1584047538
  threshold_x_quantized: 1134376789
  threshold_x_quantized: 1206081565
  threshold_x_quantized: 1955180426
  threshold_x_quantized: 1568866733
  threshold_x_quantized: 1398210639
  threshold_x_quantized: 2002319447
  threshold_x_quantized: 1768901252
  threshold_x_quantized: 1480335231
  threshold_x_quantized: 1912064444
  threshold_x_quantized: 1839940701
  threshold_x_quantized: 1494818619
  threshold_x_quantized: 2011830616
  threshold_x_quantized: 1603160404
  threshold_x_quantized: 1834225915
  threshold_x_quantized: 2080109898
  threshold_x_quantized: 1894000968
  threshold_x_quantized: 1636431145
  threshold_x_quantized: 1816888117
  threshold_x_quantized: 1260357115
  threshold_x_quantized: 1087850176
  threshold_x_quantized: 1263142503
  threshold_x_quantized: 1945640882
  threshold_x_quantized: 1676083914
  threshold_x_quantized: 1823817809
  threshold_x_quantized: 2128824355
  threshold_x_quantized: 1173846477
  threshold_x_quantized: 1135494863
  threshold_x_quantized: 1232376224
  threshold_x_quantized: 1561432388
  threshold_x_quantized: 1746511406
  threshold_x_quantized: 1651617918
  blob_param {
    name: "mobilenet0_batchnorm10"
    threshold_y: 1.19256234169
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 17
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
}
layer {
  name: "mobilenet0_relu10"
  threshold_y: 1.19256234169
  blob_param {
    name: "mobilenet0_batchnorm10"
    threshold_y: 1.19256234169
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv11"
  threshold_y: 1.91338133812
  threshold_x_quantized: 1470216543
  threshold_x_quantized: 1607014368
  threshold_x_quantized: 1432729905
  threshold_x_quantized: 1249768579
  threshold_x_quantized: 1531762664
  threshold_x_quantized: 1147156368
  threshold_x_quantized: 1388426616
  threshold_x_quantized: 1307509553
  threshold_x_quantized: 2118889187
  threshold_x_quantized: 1641078479
  threshold_x_quantized: 1096702743
  threshold_x_quantized: 1933462764
  threshold_x_quantized: 1099809264
  threshold_x_quantized: 1142470938
  threshold_x_quantized: 1977935664
  threshold_x_quantized: 1436504577
  threshold_x_quantized: 1541622731
  threshold_x_quantized: 1699329721
  threshold_x_quantized: 1472531734
  threshold_x_quantized: 1330540524
  threshold_x_quantized: 1135002570
  threshold_x_quantized: 1275360222
  threshold_x_quantized: 1278955550
  threshold_x_quantized: 1589813819
  threshold_x_quantized: 1360566453
  threshold_x_quantized: 2127059691
  threshold_x_quantized: 1116342301
  threshold_x_quantized: 1260127905
  threshold_x_quantized: 1164661754
  threshold_x_quantized: 1698624792
  threshold_x_quantized: 1408008893
  threshold_x_quantized: 1258249345
  threshold_x_quantized: 1446051272
  threshold_x_quantized: 1079564422
  threshold_x_quantized: 1213047902
  threshold_x_quantized: 1240472072
  threshold_x_quantized: 1597676376
  threshold_x_quantized: 1464861765
  threshold_x_quantized: 1356855764
  threshold_x_quantized: 1359392422
  threshold_x_quantized: 1438511502
  threshold_x_quantized: 1511028376
  threshold_x_quantized: 1949395144
  threshold_x_quantized: 1094647392
  threshold_x_quantized: 1090448056
  threshold_x_quantized: 1418025806
  threshold_x_quantized: 1163886779
  threshold_x_quantized: 1265613441
  threshold_x_quantized: 1918528901
  threshold_x_quantized: 1980750592
  threshold_x_quantized: 1933029244
  threshold_x_quantized: 1601026463
  threshold_x_quantized: 1640909028
  threshold_x_quantized: 1423853515
  threshold_x_quantized: 1167095098
  threshold_x_quantized: 1491414028
  threshold_x_quantized: 2122313947
  threshold_x_quantized: 1475534463
  threshold_x_quantized: 1641196393
  threshold_x_quantized: 1303320349
  threshold_x_quantized: 1556421449
  threshold_x_quantized: 1737764614
  threshold_x_quantized: 1337635286
  threshold_x_quantized: 1676820027
  blob_param {
    name: "mobilenet0_batchnorm11"
    threshold_y: 1.91338133812
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 15
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
}
layer {
  name: "rf_c1_red_conv"
  threshold_y: 2.51810884476
  threshold_x_quantized: 1352217992
  threshold_x_quantized: 1169196126
  threshold_x_quantized: 1317950668
  threshold_x_quantized: 1238949479
  threshold_x_quantized: 1211837750
  threshold_x_quantized: 1112444812
  threshold_x_quantized: 1515130356
  threshold_x_quantized: 1816652613
  threshold_x_quantized: 2102320413
  threshold_x_quantized: 1238589395
  threshold_x_quantized: 1631350098
  threshold_x_quantized: 1323888285
  threshold_x_quantized: 1490224714
  threshold_x_quantized: 1496390626
  threshold_x_quantized: 1201936187
  threshold_x_quantized: 1864296850
  threshold_x_quantized: 2086242995
  threshold_x_quantized: 1709160103
  threshold_x_quantized: 1316214509
  threshold_x_quantized: 1279838577
  threshold_x_quantized: 2004264026
  threshold_x_quantized: 1972035598
  threshold_x_quantized: 1755689294
  threshold_x_quantized: 1603504624
  threshold_x_quantized: 1861107263
  threshold_x_quantized: 1735511655
  threshold_x_quantized: 1237094746
  threshold_x_quantized: 1247026499
  threshold_x_quantized: 1139302663
  threshold_x_quantized: 1666212347
  threshold_x_quantized: 1731446593
  threshold_x_quantized: 1560785163
  threshold_x_quantized: 2129985239
  threshold_x_quantized: 1384034081
  threshold_x_quantized: 1458592546
  threshold_x_quantized: 1338363756
  threshold_x_quantized: 1786743752
  threshold_x_quantized: 1347952762
  threshold_x_quantized: 1417871608
  threshold_x_quantized: 1098734003
  threshold_x_quantized: 2113097209
  threshold_x_quantized: 1886227743
  threshold_x_quantized: 1098448482
  threshold_x_quantized: 1273004874
  threshold_x_quantized: 2019641645
  threshold_x_quantized: 1392028901
  threshold_x_quantized: 1984471567
  threshold_x_quantized: 1144682090
  threshold_x_quantized: 2094243635
  threshold_x_quantized: 1910410187
  threshold_x_quantized: 1437821194
  threshold_x_quantized: 1931740820
  threshold_x_quantized: 1402114265
  threshold_x_quantized: 1600984404
  threshold_x_quantized: 1982737711
  threshold_x_quantized: 1604689262
  threshold_x_quantized: 2115677200
  threshold_x_quantized: 1802341422
  threshold_x_quantized: 1358215622
  threshold_x_quantized: 1122961427
  threshold_x_quantized: 1695480816
  threshold_x_quantized: 1325075590
  threshold_x_quantized: 1757233651
  threshold_x_quantized: 1538302142
  blob_param {
    name: "rf_c1_red_conv_bn"
    threshold_y: 2.51810884476
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
}
layer {
  name: "mobilenet0_relu11"
  threshold_y: 1.91338133812
  blob_param {
    name: "mobilenet0_batchnorm11"
    threshold_y: 1.91338133812
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "rf_c1_red_conv_relu"
  threshold_y: 2.51810884476
  blob_param {
    name: "rf_c1_red_conv_bn"
    threshold_y: 2.51810884476
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv12"
  threshold_y: 0.901638805866
  threshold_x_quantized: 1188162542
  threshold_x_quantized: 1861690778
  threshold_x_quantized: 1312170257
  threshold_x_quantized: 1254283982
  threshold_x_quantized: 1426695208
  threshold_x_quantized: 1245082083
  threshold_x_quantized: 1257681811
  threshold_x_quantized: 1136622851
  threshold_x_quantized: 1471968989
  threshold_x_quantized: 2016506987
  threshold_x_quantized: 1415129442
  threshold_x_quantized: 1667067221
  threshold_x_quantized: 1713500186
  threshold_x_quantized: 1218908968
  threshold_x_quantized: 1251899064
  threshold_x_quantized: 1292730868
  threshold_x_quantized: 1224809874
  threshold_x_quantized: 1275367281
  threshold_x_quantized: 1150386584
  threshold_x_quantized: 1287014535
  threshold_x_quantized: 1130401217
  threshold_x_quantized: 1358725185
  threshold_x_quantized: 2022298561
  threshold_x_quantized: 1658745813
  threshold_x_quantized: 1533559764
  threshold_x_quantized: 1802704127
  threshold_x_quantized: 1409313149
  threshold_x_quantized: 1904923390
  threshold_x_quantized: 1232337848
  threshold_x_quantized: 1376522566
  threshold_x_quantized: 1118446545
  threshold_x_quantized: 1195820763
  threshold_x_quantized: 1578776910
  threshold_x_quantized: 1250192001
  threshold_x_quantized: 1507855891
  threshold_x_quantized: 1119096557
  threshold_x_quantized: 2097693746
  threshold_x_quantized: 1627953889
  threshold_x_quantized: 1358543056
  threshold_x_quantized: 1340194536
  threshold_x_quantized: 1081953567
  threshold_x_quantized: 1391189268
  threshold_x_quantized: 1338685763
  threshold_x_quantized: 1076778118
  threshold_x_quantized: 1082676104
  threshold_x_quantized: 1174097503
  threshold_x_quantized: 1634909537
  threshold_x_quantized: 1166474458
  threshold_x_quantized: 1365914571
  threshold_x_quantized: 1324217080
  threshold_x_quantized: 1798381531
  threshold_x_quantized: 1923818839
  threshold_x_quantized: 2086542354
  threshold_x_quantized: 1368087753
  threshold_x_quantized: 1323391323
  threshold_x_quantized: 1123347103
  threshold_x_quantized: 1965578669
  threshold_x_quantized: 1102109314
  threshold_x_quantized: 1209034512
  threshold_x_quantized: 1491618213
  threshold_x_quantized: 1523605584
  threshold_x_quantized: 1583764458
  threshold_x_quantized: 1726170266
  threshold_x_quantized: 1962474201
  threshold_x_quantized: 1265395852
  threshold_x_quantized: 2074106148
  threshold_x_quantized: 1243047026
  threshold_x_quantized: 1171527876
  threshold_x_quantized: 1263252821
  threshold_x_quantized: 1647002945
  threshold_x_quantized: 1200611107
  threshold_x_quantized: 1530455432
  threshold_x_quantized: 1849828935
  threshold_x_quantized: 2136826228
  threshold_x_quantized: 2087585144
  threshold_x_quantized: 1093211235
  threshold_x_quantized: 1812863116
  threshold_x_quantized: 2006051512
  threshold_x_quantized: 1710014892
  threshold_x_quantized: 1259078400
  threshold_x_quantized: 1182992187
  threshold_x_quantized: 1846011573
  threshold_x_quantized: 2037169122
  threshold_x_quantized: 1086315073
  threshold_x_quantized: 1594316225
  threshold_x_quantized: 1648370470
  threshold_x_quantized: 1302345645
  threshold_x_quantized: 1615760521
  threshold_x_quantized: 1753662963
  threshold_x_quantized: 1087983973
  threshold_x_quantized: 1089006187
  threshold_x_quantized: 1206308969
  threshold_x_quantized: 1518164413
  threshold_x_quantized: 2130672570
  threshold_x_quantized: 1341975754
  threshold_x_quantized: 1210973412
  threshold_x_quantized: 1398979230
  threshold_x_quantized: 2112055271
  threshold_x_quantized: 1981815803
  threshold_x_quantized: 1636986969
  threshold_x_quantized: 1518868751
  threshold_x_quantized: 1096496676
  threshold_x_quantized: 1251766373
  threshold_x_quantized: 1459266585
  threshold_x_quantized: 1813189616
  threshold_x_quantized: 1972413034
  threshold_x_quantized: 1785411027
  threshold_x_quantized: 1074001916
  threshold_x_quantized: 2077350370
  threshold_x_quantized: 1209464368
  threshold_x_quantized: 2028152068
  threshold_x_quantized: 1349508618
  threshold_x_quantized: 1656519935
  threshold_x_quantized: 1160128756
  threshold_x_quantized: 1827463540
  threshold_x_quantized: 1526806888
  threshold_x_quantized: 1719958207
  threshold_x_quantized: 1281358232
  threshold_x_quantized: 1353516801
  threshold_x_quantized: 1459512818
  threshold_x_quantized: 1226736958
  threshold_x_quantized: 1582845667
  threshold_x_quantized: 1949348868
  threshold_x_quantized: 1125098713
  threshold_x_quantized: 1572501697
  threshold_x_quantized: 1522706894
  threshold_x_quantized: 1590397408
  threshold_x_quantized: 1615395721
  blob_param {
    name: "mobilenet0_batchnorm12"
    threshold_y: 0.901638805866
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
}
layer {
  name: "mobilenet0_relu12"
  threshold_y: 0.901638805866
  blob_param {
    name: "mobilenet0_batchnorm12"
    threshold_y: 0.901638805866
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "mobilenet0_conv13"
  threshold_y: 1.56332063675
  threshold_x_quantized: 1132349026
  threshold_x_quantized: 1687551414
  threshold_x_quantized: 1239204746
  threshold_x_quantized: 1593128085
  threshold_x_quantized: 1745234865
  threshold_x_quantized: 1589381396
  threshold_x_quantized: 1604890084
  threshold_x_quantized: 1640317824
  threshold_x_quantized: 2110441975
  threshold_x_quantized: 2134447451
  threshold_x_quantized: 1314972144
  threshold_x_quantized: 1176711326
  threshold_x_quantized: 1790137701
  threshold_x_quantized: 1876295311
  threshold_x_quantized: 1537650922
  threshold_x_quantized: 1707668460
  threshold_x_quantized: 1543924736
  threshold_x_quantized: 1261701270
  threshold_x_quantized: 1419461010
  threshold_x_quantized: 1986983724
  threshold_x_quantized: 1367280951
  threshold_x_quantized: 2036609933
  threshold_x_quantized: 1897052701
  threshold_x_quantized: 1999170356
  threshold_x_quantized: 2038737673
  threshold_x_quantized: 1920629262
  threshold_x_quantized: 1251663492
  threshold_x_quantized: 1903749819
  threshold_x_quantized: 1913014370
  threshold_x_quantized: 1513741417
  threshold_x_quantized: 1734851741
  threshold_x_quantized: 1729906897
  threshold_x_quantized: 1641071266
  threshold_x_quantized: 2109674063
  threshold_x_quantized: 1131394489
  threshold_x_quantized: 1091746851
  threshold_x_quantized: 1710111278
  threshold_x_quantized: 1959212513
  threshold_x_quantized: 1996009678
  threshold_x_quantized: 1348051116
  threshold_x_quantized: 1712778078
  threshold_x_quantized: 1149503019
  threshold_x_quantized: 1654862526
  threshold_x_quantized: 1768679283
  threshold_x_quantized: 1876714776
  threshold_x_quantized: 1204729551
  threshold_x_quantized: 1941058729
  threshold_x_quantized: 2141988814
  threshold_x_quantized: 1941073493
  threshold_x_quantized: 1441768988
  threshold_x_quantized: 2036730265
  threshold_x_quantized: 1508089196
  threshold_x_quantized: 1180424056
  threshold_x_quantized: 1272356508
  threshold_x_quantized: 1522349825
  threshold_x_quantized: 2146135627
  threshold_x_quantized: 1523830429
  threshold_x_quantized: 1929901491
  threshold_x_quantized: 1272961270
  threshold_x_quantized: 1141434998
  threshold_x_quantized: 1293052182
  threshold_x_quantized: 1082733226
  threshold_x_quantized: 1287372203
  threshold_x_quantized: 1667590431
  threshold_x_quantized: 1618810978
  threshold_x_quantized: 2062861414
  threshold_x_quantized: 2078101386
  threshold_x_quantized: 1636417877
  threshold_x_quantized: 1486581611
  threshold_x_quantized: 1803030381
  threshold_x_quantized: 1300212616
  threshold_x_quantized: 1075850663
  threshold_x_quantized: 1121302598
  threshold_x_quantized: 1380069392
  threshold_x_quantized: 1341537080
  threshold_x_quantized: 1142684830
  threshold_x_quantized: 1284654466
  threshold_x_quantized: 1262501812
  threshold_x_quantized: 1090632338
  threshold_x_quantized: 2005334912
  threshold_x_quantized: 1131402092
  threshold_x_quantized: 1117772433
  threshold_x_quantized: 1493967503
  threshold_x_quantized: 1642954060
  threshold_x_quantized: 1105507991
  threshold_x_quantized: 1467122185
  threshold_x_quantized: 2015552229
  threshold_x_quantized: 2095857261
  threshold_x_quantized: 2039992082
  threshold_x_quantized: 1723753710
  threshold_x_quantized: 1736684630
  threshold_x_quantized: 1836209162
  threshold_x_quantized: 1133284296
  threshold_x_quantized: 1243117243
  threshold_x_quantized: 1256758050
  threshold_x_quantized: 1805581277
  threshold_x_quantized: 1250616379
  threshold_x_quantized: 1151900879
  threshold_x_quantized: 1997465624
  threshold_x_quantized: 1419441815
  threshold_x_quantized: 2109496592
  threshold_x_quantized: 1905362272
  threshold_x_quantized: 1379005891
  threshold_x_quantized: 1789203096
  threshold_x_quantized: 1406200836
  threshold_x_quantized: 1244550452
  threshold_x_quantized: 1409985323
  threshold_x_quantized: 1094825660
  threshold_x_quantized: 2009928504
  threshold_x_quantized: 1827908302
  threshold_x_quantized: 1486434112
  threshold_x_quantized: 1884963073
  threshold_x_quantized: 1302215890
  threshold_x_quantized: 2069366149
  threshold_x_quantized: 1522712741
  threshold_x_quantized: 1863884698
  threshold_x_quantized: 1316909420
  threshold_x_quantized: 1865767787
  threshold_x_quantized: 1504547441
  threshold_x_quantized: 1227935740
  threshold_x_quantized: 2118798645
  threshold_x_quantized: 1933332511
  threshold_x_quantized: 1885735857
  threshold_x_quantized: 1880045543
  threshold_x_quantized: 1125364513
  threshold_x_quantized: 1385030625
  threshold_x_quantized: 1565679777
  threshold_x_quantized: 1134049255
  blob_param {
    name: "mobilenet0_batchnorm13"
    threshold_y: 1.56332063675
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
