name: "retina_resnet"
layer {
  name: "input"
  threshold_y: 152.000732422
  blob_param {
    name: "data"
    threshold_y: 152.000732422
  }
  top_unsigned: false
}
layer {
  name: "bn_data_scale"
  threshold_y: 3.44255185127
  right_shift_width: 7
  blob_param {
    name: "bn_data"
    threshold_y: 3.44255185127
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "conv0"
  threshold_y: 2.53123855591
  threshold_x_quantized: 2061530895
  threshold_x_quantized: 1923456291
  threshold_x_quantized: 2094146814
  threshold_x_quantized: 1554072709
  threshold_x_quantized: 1992677425
  threshold_x_quantized: 1271646750
  threshold_x_quantized: 1240601324
  threshold_x_quantized: 1290626890
  threshold_x_quantized: 1166426646
  threshold_x_quantized: 1332790065
  threshold_x_quantized: 1689136018
  threshold_x_quantized: 1832891486
  threshold_x_quantized: 1504245163
  threshold_x_quantized: 1879456361
  threshold_x_quantized: 1392247819
  threshold_x_quantized: 1105603209
  threshold_x_quantized: 1199296031
  threshold_x_quantized: 1096607884
  threshold_x_quantized: 1091998155
  threshold_x_quantized: 2090751840
  threshold_x_quantized: 0
  threshold_x_quantized: 2107478992
  threshold_x_quantized: 2145801714
  threshold_x_quantized: 0
  threshold_x_quantized: 1660418349
  threshold_x_quantized: 1289402039
  threshold_x_quantized: 1314391538
  threshold_x_quantized: 2031405239
  threshold_x_quantized: 1268288594
  threshold_x_quantized: 1687230675
  threshold_x_quantized: 1169805605
  threshold_x_quantized: 1981085385
  threshold_x_quantized: 1233143155
  threshold_x_quantized: 1246113675
  threshold_x_quantized: 2119516338
  threshold_x_quantized: 1157694187
  threshold_x_quantized: 0
  threshold_x_quantized: 1918085121
  threshold_x_quantized: 1882199045
  threshold_x_quantized: 1330479282
  threshold_x_quantized: 1496391738
  threshold_x_quantized: 1162078391
  threshold_x_quantized: 1921789790
  threshold_x_quantized: 1620856153
  threshold_x_quantized: 1599103909
  threshold_x_quantized: 2068847098
  threshold_x_quantized: 1185926164
  threshold_x_quantized: 1827363816
  threshold_x_quantized: 1216672166
  threshold_x_quantized: 1766065740
  threshold_x_quantized: 2031855244
  threshold_x_quantized: 1754453680
  threshold_x_quantized: 1993718792
  threshold_x_quantized: 1771494705
  threshold_x_quantized: 1919351230
  threshold_x_quantized: 1365266979
  threshold_x_quantized: 1319072902
  threshold_x_quantized: 1824445656
  threshold_x_quantized: 1084042630
  threshold_x_quantized: 2127806364
  threshold_x_quantized: 1080533109
  threshold_x_quantized: 1719534986
  threshold_x_quantized: 1959046599
  threshold_x_quantized: 1081077468
  blob_param {
    name: "bn0"
    threshold_y: 2.53123855591
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 9
  right_shift_array: 13
  right_shift_array: 11
  right_shift_array: 11
  right_shift_array: 8
  right_shift_array: 10
  right_shift_array: 13
  right_shift_array: 9
  right_shift_array: 10
  right_shift_array: 11
  right_shift_array: 9
  right_shift_array: 12
  right_shift_array: 9
  right_shift_array: 12
  right_shift_array: 8
  right_shift_array: 12
  right_shift_array: 12
  right_shift_array: 14
  right_shift_array: 12
  right_shift_array: 12
  right_shift_array: 0
  right_shift_array: 10
  right_shift_array: 12
  right_shift_array: 0
  right_shift_array: 12
  right_shift_array: 12
  right_shift_array: 8
  right_shift_array: 10
  right_shift_array: 10
  right_shift_array: 12
  right_shift_array: 11
  right_shift_array: 14
  right_shift_array: 11
  right_shift_array: 10
  right_shift_array: 11
  right_shift_array: 11
  right_shift_array: 0
  right_shift_array: 10
  right_shift_array: 12
  right_shift_array: 11
  right_shift_array: 12
  right_shift_array: 11
  right_shift_array: 11
  right_shift_array: 13
  right_shift_array: 10
  right_shift_array: 13
  right_shift_array: 14
  right_shift_array: 16
  right_shift_array: 10
  right_shift_array: 13
  right_shift_array: 12
  right_shift_array: 12
  right_shift_array: 12
  right_shift_array: 12
  right_shift_array: 12
  right_shift_array: 11
  right_shift_array: 10
  right_shift_array: 12
  right_shift_array: 11
  right_shift_array: 12
  right_shift_array: 10
  right_shift_array: 10
  right_shift_array: 9
  right_shift_array: 10
}
layer {
  name: "relu0"
  threshold_y: 2.53123855591
  blob_param {
    name: "bn0"
    threshold_y: 2.53123855591
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "pooling0"
  threshold_y: 2.52929401398
  right_shift_width: 7
  threshold_x_quantized: 128
  blob_param {
    name: "pooling0"
    threshold_y: 2.52929401398
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "stage1_unit1_bn1_scale"
  threshold_y: 7.93078899384
  right_shift_width: 4
  blob_param {
    name: "stage1_unit1_bn1"
    threshold_y: 7.93078899384
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "stage1_unit1_relu1"
  threshold_y: 7.93078899384
  blob_param {
    name: "stage1_unit1_bn1"
    threshold_y: 7.93078899384
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "stage1_unit1_conv1"
  threshold_y: 16.2142543793
  threshold_x_quantized: 1333992790
  threshold_x_quantized: 1263713504
  threshold_x_quantized: 2113541974
  threshold_x_quantized: 1188407427
  threshold_x_quantized: 1109424136
  threshold_x_quantized: 1346809636
  threshold_x_quantized: 1338833385
  threshold_x_quantized: 2066383173
  threshold_x_quantized: 1544344183
  threshold_x_quantized: 1267524324
  threshold_x_quantized: 1246244513
  threshold_x_quantized: 1697562580
  threshold_x_quantized: 1442082135
  threshold_x_quantized: 1288325184
  threshold_x_quantized: 1466866613
  threshold_x_quantized: 1725606052
  threshold_x_quantized: 1478456469
  threshold_x_quantized: 1360081016
  threshold_x_quantized: 1353720926
  threshold_x_quantized: 1739203744
  threshold_x_quantized: 1132021593
  threshold_x_quantized: 1657314067
  threshold_x_quantized: 1960458560
  threshold_x_quantized: 1900190408
  threshold_x_quantized: 1163973679
  threshold_x_quantized: 1797787993
  threshold_x_quantized: 1261957101
  threshold_x_quantized: 1162309560
  threshold_x_quantized: 1130239772
  threshold_x_quantized: 1247040886
  threshold_x_quantized: 2053586362
  threshold_x_quantized: 1237460494
  threshold_x_quantized: 2113361413
  threshold_x_quantized: 1421099085
  threshold_x_quantized: 1230331454
  threshold_x_quantized: 1998849496
  threshold_x_quantized: 1386088728
  threshold_x_quantized: 1304706175
  threshold_x_quantized: 1300836754
  threshold_x_quantized: 1391047276
  threshold_x_quantized: 1438400162
  threshold_x_quantized: 1138929753
  threshold_x_quantized: 1130238770
  threshold_x_quantized: 1893110954
  threshold_x_quantized: 1742796062
  threshold_x_quantized: 1451004642
  threshold_x_quantized: 1769241028
  threshold_x_quantized: 1164035410
  threshold_x_quantized: 1919700293
  threshold_x_quantized: 2069991018
  threshold_x_quantized: 1713302090
  threshold_x_quantized: 1764058093
  threshold_x_quantized: 1535639802
  threshold_x_quantized: 1920173985
  threshold_x_quantized: 1533867371
  threshold_x_quantized: 2062470803
  threshold_x_quantized: 2071119213
  threshold_x_quantized: 1903955274
  threshold_x_quantized: 1711525778
  threshold_x_quantized: 2084454202
  threshold_x_quantized: 1845950399
  threshold_x_quantized: 1882623624
  threshold_x_quantized: 1105932241
  threshold_x_quantized: 1617296828
  blob_param {
    name: "stage1_unit1_bn2"
    threshold_y: 16.2142543793
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 10
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 10
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 11
  right_shift_array: 10
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 11
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 10
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
}
layer {
  name: "stage1_unit1_sc"
  threshold_y: 5.09123134613
  threshold_x_quantized: 1234388751
  threshold_x_quantized: 1658168425
  threshold_x_quantized: 1996226618
  threshold_x_quantized: 1833233608
  threshold_x_quantized: 1886249035
  threshold_x_quantized: 1552940713
  threshold_x_quantized: 1234811159
  threshold_x_quantized: 1374545916
  threshold_x_quantized: 1102725105
  threshold_x_quantized: 1377398390
  threshold_x_quantized: 1992634406
  threshold_x_quantized: 1333177760
  threshold_x_quantized: 1186548792
  threshold_x_quantized: 1852398184
  threshold_x_quantized: 1787839666
  threshold_x_quantized: 1970368916
  threshold_x_quantized: 1387548342
  threshold_x_quantized: 1698902322
  threshold_x_quantized: 1460762881
  threshold_x_quantized: 1197655716
  threshold_x_quantized: 1089597263
  threshold_x_quantized: 2087122571
  threshold_x_quantized: 1099827569
  threshold_x_quantized: 1497598104
  threshold_x_quantized: 1343240578
  threshold_x_quantized: 1899377277
  threshold_x_quantized: 1453894292
  threshold_x_quantized: 1695690746
  threshold_x_quantized: 1969879014
  threshold_x_quantized: 1928079876
  threshold_x_quantized: 1916393225
  threshold_x_quantized: 2129204444
  threshold_x_quantized: 1195772976
  threshold_x_quantized: 1820848493
  threshold_x_quantized: 1712063861
  threshold_x_quantized: 1129541575
  threshold_x_quantized: 1115993319
  threshold_x_quantized: 1504861386
  threshold_x_quantized: 1386352002
  threshold_x_quantized: 1103301841
  threshold_x_quantized: 1588981765
  threshold_x_quantized: 2007077825
  threshold_x_quantized: 1984896875
  threshold_x_quantized: 1891209262
  threshold_x_quantized: 1501786193
  threshold_x_quantized: 1625766043
  threshold_x_quantized: 1849642613
  threshold_x_quantized: 1085838162
  threshold_x_quantized: 1313422690
  threshold_x_quantized: 1189491989
  threshold_x_quantized: 1449505019
  threshold_x_quantized: 1870086875
  threshold_x_quantized: 2064055931
  threshold_x_quantized: 1313382313
  threshold_x_quantized: 1285352754
  threshold_x_quantized: 1768944266
  threshold_x_quantized: 1523229199
  threshold_x_quantized: 1391711407
  threshold_x_quantized: 1797411985
  threshold_x_quantized: 1154859728
  threshold_x_quantized: 1278566414
  threshold_x_quantized: 2114697819
  threshold_x_quantized: 1774121031
  threshold_x_quantized: 1534231444
  threshold_x_quantized: 1239447078
  threshold_x_quantized: 2005458777
  threshold_x_quantized: 1781485702
  threshold_x_quantized: 1812806693
  threshold_x_quantized: 1956621369
  threshold_x_quantized: 1435318016
  threshold_x_quantized: 1987128050
  threshold_x_quantized: 1399478947
  threshold_x_quantized: 2046935501
  threshold_x_quantized: 1841180897
  threshold_x_quantized: 1458080387
  threshold_x_quantized: 1597459831
  threshold_x_quantized: 1175996172
  threshold_x_quantized: 1751947259
  threshold_x_quantized: 1179795749
  threshold_x_quantized: 1223295585
  threshold_x_quantized: 2086589800
  threshold_x_quantized: 1816901168
  threshold_x_quantized: 1628010278
  threshold_x_quantized: 1100623235
  threshold_x_quantized: 1317269123
  threshold_x_quantized: 1291517995
  threshold_x_quantized: 1586295781
  threshold_x_quantized: 1492701084
  threshold_x_quantized: 1185966374
  threshold_x_quantized: 1522293561
  threshold_x_quantized: 1578265047
  threshold_x_quantized: 1554470434
  threshold_x_quantized: 1797132240
  threshold_x_quantized: 1212565308
  threshold_x_quantized: 1709945342
  threshold_x_quantized: 1877754619
  threshold_x_quantized: 2013490209
  threshold_x_quantized: 1710775004
  threshold_x_quantized: 1441353554
  threshold_x_quantized: 2110126204
  threshold_x_quantized: 2093624681
  threshold_x_quantized: 1083561925
  threshold_x_quantized: 1966643910
  threshold_x_quantized: 1090914234
  threshold_x_quantized: 1534955928
  threshold_x_quantized: 1202030135
  threshold_x_quantized: 1266887638
  threshold_x_quantized: 1104677732
  threshold_x_quantized: 1539607299
  threshold_x_quantized: 1917874893
  threshold_x_quantized: 1276338828
  threshold_x_quantized: 1568674185
  threshold_x_quantized: 1755300801
  threshold_x_quantized: 1542356191
  threshold_x_quantized: 1190762104
  threshold_x_quantized: 1782149472
  threshold_x_quantized: 1568603900
  threshold_x_quantized: 2059353515
  threshold_x_quantized: 1525837421
  threshold_x_quantized: 1786622589
  threshold_x_quantized: 2034353589
  threshold_x_quantized: 1201817187
  threshold_x_quantized: 1500013814
  threshold_x_quantized: 1748281074
  threshold_x_quantized: 1119535483
  threshold_x_quantized: 1996226419
  threshold_x_quantized: 1702065247
  threshold_x_quantized: 1855732783
  threshold_x_quantized: 1747543929
  threshold_x_quantized: 1723177066
  threshold_x_quantized: 1218464563
  threshold_x_quantized: 1402540282
  threshold_x_quantized: 1592251164
  threshold_x_quantized: 1483275516
  threshold_x_quantized: 2093270564
  threshold_x_quantized: 1311761072
  threshold_x_quantized: 1316173774
  threshold_x_quantized: 1671147024
  threshold_x_quantized: 1161738486
  threshold_x_quantized: 1159176922
  threshold_x_quantized: 1813064903
  threshold_x_quantized: 1338277360
  threshold_x_quantized: 1246173702
  threshold_x_quantized: 1168575372
  threshold_x_quantized: 1211290807
  threshold_x_quantized: 1765565402
  threshold_x_quantized: 1348848124
  threshold_x_quantized: 2005683091
  threshold_x_quantized: 2053815855
  threshold_x_quantized: 1117287659
  threshold_x_quantized: 2083007359
  threshold_x_quantized: 1178204317
  threshold_x_quantized: 1345759373
  threshold_x_quantized: 1825500862
  threshold_x_quantized: 1608677317
  threshold_x_quantized: 1760630498
  threshold_x_quantized: 1973460259
  threshold_x_quantized: 1568860814
  threshold_x_quantized: 2059292901
  threshold_x_quantized: 1538606860
  threshold_x_quantized: 1607937280
  threshold_x_quantized: 1530175252
  threshold_x_quantized: 1107473580
  threshold_x_quantized: 1161173713
  threshold_x_quantized: 1946940981
  threshold_x_quantized: 1877288844
  threshold_x_quantized: 1676853169
  threshold_x_quantized: 1823405471
  threshold_x_quantized: 1232031961
  threshold_x_quantized: 1221890383
  threshold_x_quantized: 1444754949
  threshold_x_quantized: 1455970342
  threshold_x_quantized: 1302320850
  threshold_x_quantized: 1095194541
  threshold_x_quantized: 2114809079
  threshold_x_quantized: 1838382657
  threshold_x_quantized: 1158118160
  threshold_x_quantized: 1423973519
  threshold_x_quantized: 1697770783
  threshold_x_quantized: 2014819742
  threshold_x_quantized: 1663207611
  threshold_x_quantized: 1215321378
  threshold_x_quantized: 1369079438
  threshold_x_quantized: 1207618740
  threshold_x_quantized: 1898620392
  threshold_x_quantized: 1455573954
  threshold_x_quantized: 1813085839
  threshold_x_quantized: 1419371097
  threshold_x_quantized: 1302140103
  threshold_x_quantized: 1746860420
  threshold_x_quantized: 1566307823
  threshold_x_quantized: 1158079179
  threshold_x_quantized: 1766341428
  threshold_x_quantized: 1319195132
  threshold_x_quantized: 1985351485
  threshold_x_quantized: 1660959089
  threshold_x_quantized: 1353497901
  threshold_x_quantized: 1152174043
  threshold_x_quantized: 1279343237
  threshold_x_quantized: 1559838812
  threshold_x_quantized: 1130098172
  threshold_x_quantized: 1515303843
  threshold_x_quantized: 1406205470
  threshold_x_quantized: 1931130943
  threshold_x_quantized: 1840572957
  threshold_x_quantized: 1778197561
  threshold_x_quantized: 1195637889
  threshold_x_quantized: 1517920040
  threshold_x_quantized: 1728018257
  threshold_x_quantized: 1822393966
  threshold_x_quantized: 1616070202
  threshold_x_quantized: 1096821664
  threshold_x_quantized: 1117536897
  threshold_x_quantized: 1646913354
  threshold_x_quantized: 1693512210
  threshold_x_quantized: 1447029691
  threshold_x_quantized: 1489499776
  threshold_x_quantized: 1740570859
  threshold_x_quantized: 1823600874
  threshold_x_quantized: 1812980361
  threshold_x_quantized: 1612560239
  threshold_x_quantized: 1872205793
  threshold_x_quantized: 1154953541
  threshold_x_quantized: 1206086626
  threshold_x_quantized: 1738718924
  threshold_x_quantized: 1080045681
  threshold_x_quantized: 1326937149
  threshold_x_quantized: 1354453777
  threshold_x_quantized: 2048956120
  threshold_x_quantized: 2033467500
  threshold_x_quantized: 2099950132
  threshold_x_quantized: 1328863158
  threshold_x_quantized: 1544773696
  threshold_x_quantized: 1516976526
  threshold_x_quantized: 1124333905
  threshold_x_quantized: 2132283226
  threshold_x_quantized: 2027153414
  threshold_x_quantized: 1830486810
  threshold_x_quantized: 1702072823
  threshold_x_quantized: 1505015514
  threshold_x_quantized: 1576941097
  threshold_x_quantized: 1104323018
  threshold_x_quantized: 1938403297
  threshold_x_quantized: 1424880345
  threshold_x_quantized: 2110507836
  threshold_x_quantized: 1508777706
  threshold_x_quantized: 1256725524
  threshold_x_quantized: 1940601174
  threshold_x_quantized: 1152804215
  threshold_x_quantized: 1490401518
  threshold_x_quantized: 1563026162
  threshold_x_quantized: 1406845214
  threshold_x_quantized: 1218919471
  threshold_x_quantized: 1766995029
  threshold_x_quantized: 1850853310
  threshold_x_quantized: 1145715300
  blob_param {
    name: "stage1_unit1_sc"
    threshold_y: 5.09123134613
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 11
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 10
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 10
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 10
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 10
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 10
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 10
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 10
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 10
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 10
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 10
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 10
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 10
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 10
  right_shift_array: 10
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 10
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 10
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 8
}
layer {
  name: "stage1_unit1_relu2"
  threshold_y: 16.2142543793
  blob_param {
    name: "stage1_unit1_bn2"
    threshold_y: 16.2142543793
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "stage1_unit1_conv2"
  threshold_y: 18.6030387878
  threshold_x_quantized: 1089555459
  threshold_x_quantized: 2132972396
  threshold_x_quantized: 2123958715
  threshold_x_quantized: 1571318810
  threshold_x_quantized: 1471240893
  threshold_x_quantized: 1617685592
  threshold_x_quantized: 1551824274
  threshold_x_quantized: 1740337316
  threshold_x_quantized: 1913753666
  threshold_x_quantized: 1741082339
  threshold_x_quantized: 2010836654
  threshold_x_quantized: 1979426999
  threshold_x_quantized: 1588531979
  threshold_x_quantized: 1162576827
  threshold_x_quantized: 1874060180
  threshold_x_quantized: 1649153149
  threshold_x_quantized: 1911454114
  threshold_x_quantized: 1464546288
  threshold_x_quantized: 1232128786
  threshold_x_quantized: 1093668703
  threshold_x_quantized: 1735914149
  threshold_x_quantized: 1841761250
  threshold_x_quantized: 1135689297
  threshold_x_quantized: 1873476255
  threshold_x_quantized: 1431180920
  threshold_x_quantized: 1437104955
  threshold_x_quantized: 1676640111
  threshold_x_quantized: 1300935275
  threshold_x_quantized: 1903079470
  threshold_x_quantized: 1180941334
  threshold_x_quantized: 1270921506
  threshold_x_quantized: 1311064259
  threshold_x_quantized: 1726333278
  threshold_x_quantized: 1562130755
  threshold_x_quantized: 1950313995
  threshold_x_quantized: 1178673355
  threshold_x_quantized: 2008069427
  threshold_x_quantized: 2085329548
  threshold_x_quantized: 1308563446
  threshold_x_quantized: 1628157523
  threshold_x_quantized: 1673415250
  threshold_x_quantized: 1680487498
  threshold_x_quantized: 1628080432
  threshold_x_quantized: 1374449309
  threshold_x_quantized: 2095590288
  threshold_x_quantized: 1349855082
  threshold_x_quantized: 1234143069
  threshold_x_quantized: 1618685203
  threshold_x_quantized: 1842010930
  threshold_x_quantized: 1488785518
  threshold_x_quantized: 1667835836
  threshold_x_quantized: 2020116526
  threshold_x_quantized: 1164734581
  threshold_x_quantized: 1227871067
  threshold_x_quantized: 1930261306
  threshold_x_quantized: 1975592553
  threshold_x_quantized: 1168110500
  threshold_x_quantized: 1731860480
  threshold_x_quantized: 1903595341
  threshold_x_quantized: 1715605421
  threshold_x_quantized: 2050574542
  threshold_x_quantized: 1748351498
  threshold_x_quantized: 1910890940
  threshold_x_quantized: 1232131575
  blob_param {
    name: "stage1_unit1_bn3"
    threshold_y: 18.6030387878
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 6
  right_shift_array: 9
  right_shift_array: 8
}
layer {
  name: "stage1_unit1_relu3"
  threshold_y: 18.6030387878
  blob_param {
    name: "stage1_unit1_bn3"
    threshold_y: 18.6030387878
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "stage1_unit1_conv3"
  threshold_y: 4.23939180374
  threshold_x_quantized: 1720352534
  threshold_x_quantized: 2009924326
  threshold_x_quantized: 1401450284
  threshold_x_quantized: 1220547480
  threshold_x_quantized: 1850078268
  threshold_x_quantized: 1669226156
  threshold_x_quantized: 1455405994
  threshold_x_quantized: 1875040949
  threshold_x_quantized: 2089711357
  threshold_x_quantized: 1807516413
  threshold_x_quantized: 1270092865
  threshold_x_quantized: 1547478269
  threshold_x_quantized: 1097895075
  threshold_x_quantized: 1302403045
  threshold_x_quantized: 1722187127
  threshold_x_quantized: 1234290147
  threshold_x_quantized: 1548140772
  threshold_x_quantized: 1523781337
  threshold_x_quantized: 1934896985
  threshold_x_quantized: 1755481514
  threshold_x_quantized: 1701593347
  threshold_x_quantized: 1199549008
  threshold_x_quantized: 1572296878
  threshold_x_quantized: 1923063615
  threshold_x_quantized: 1639480333
  threshold_x_quantized: 1502138616
  threshold_x_quantized: 1739143176
  threshold_x_quantized: 1134327578
  threshold_x_quantized: 1731413311
  threshold_x_quantized: 1335033103
  threshold_x_quantized: 1543631732
  threshold_x_quantized: 1757359216
  threshold_x_quantized: 1377463946
  threshold_x_quantized: 1417755343
  threshold_x_quantized: 1812258832
  threshold_x_quantized: 1363825050
  threshold_x_quantized: 1361534652
  threshold_x_quantized: 1814766601
  threshold_x_quantized: 1785731727
  threshold_x_quantized: 1402200129
  threshold_x_quantized: 1392998097
  threshold_x_quantized: 2086814062
  threshold_x_quantized: 1754501801
  threshold_x_quantized: 2003553872
  threshold_x_quantized: 1104252329
  threshold_x_quantized: 1997143819
  threshold_x_quantized: 1423359804
  threshold_x_quantized: 1184031708
  threshold_x_quantized: 1221429882
  threshold_x_quantized: 1382188111
  threshold_x_quantized: 1215875131
  threshold_x_quantized: 1295767758
  threshold_x_quantized: 1614686578
  threshold_x_quantized: 1285029527
  threshold_x_quantized: 1349526177
  threshold_x_quantized: 1332864169
  threshold_x_quantized: 1122662993
  threshold_x_quantized: 1578453753
  threshold_x_quantized: 1157387281
  threshold_x_quantized: 1863925689
  threshold_x_quantized: 1639825908
  threshold_x_quantized: 1521506667
  threshold_x_quantized: 1235759788
  threshold_x_quantized: 1955229724
  threshold_x_quantized: 1523095524
  threshold_x_quantized: 1496169625
  threshold_x_quantized: 1344062839
  threshold_x_quantized: 1279094095
  threshold_x_quantized: 1650054975
  threshold_x_quantized: 1403196553
  threshold_x_quantized: 1213374804
  threshold_x_quantized: 1408842858
  threshold_x_quantized: 2003858163
  threshold_x_quantized: 2130742068
  threshold_x_quantized: 2071062962
  threshold_x_quantized: 1807021010
  threshold_x_quantized: 2138523466
  threshold_x_quantized: 1182736750
  threshold_x_quantized: 2022095969
  threshold_x_quantized: 2052076013
  threshold_x_quantized: 1863636282
  threshold_x_quantized: 1415834111
  threshold_x_quantized: 1671746001
  threshold_x_quantized: 2025742126
  threshold_x_quantized: 2145601780
  threshold_x_quantized: 1162413350
  threshold_x_quantized: 1802252332
  threshold_x_quantized: 1528789151
  threshold_x_quantized: 1661859981
  threshold_x_quantized: 1686040801
  threshold_x_quantized: 1952608214
  threshold_x_quantized: 1407173400
  threshold_x_quantized: 1235627933
  threshold_x_quantized: 1476925847
  threshold_x_quantized: 2145015524
  threshold_x_quantized: 1264997288
  threshold_x_quantized: 1510606390
  threshold_x_quantized: 1192067688
  threshold_x_quantized: 1730161604
  threshold_x_quantized: 2077092475
  threshold_x_quantized: 1327395917
  threshold_x_quantized: 1268157309
  threshold_x_quantized: 1479665028
  threshold_x_quantized: 1825260079
  threshold_x_quantized: 1615788598
  threshold_x_quantized: 1483380834
  threshold_x_quantized: 1105785580
  threshold_x_quantized: 1706429567
  threshold_x_quantized: 1455049045
  threshold_x_quantized: 1611361703
  threshold_x_quantized: 1225992985
  threshold_x_quantized: 1323842156
  threshold_x_quantized: 1113954328
  threshold_x_quantized: 1608772210
  threshold_x_quantized: 1881074394
  threshold_x_quantized: 1118159569
  threshold_x_quantized: 1584992571
  threshold_x_quantized: 2136323780
  threshold_x_quantized: 1239354129
  threshold_x_quantized: 1615835919
  threshold_x_quantized: 1677792505
  threshold_x_quantized: 1426531059
  threshold_x_quantized: 1271131133
  threshold_x_quantized: 1202525219
  threshold_x_quantized: 1522917330
  threshold_x_quantized: 1355057619
  threshold_x_quantized: 1610285240
  threshold_x_quantized: 1431205374
  threshold_x_quantized: 1876567460
  threshold_x_quantized: 1466978463
  threshold_x_quantized: 1712110978
  threshold_x_quantized: 1786844559
  threshold_x_quantized: 1856196246
  threshold_x_quantized: 1161561630
  threshold_x_quantized: 2141809585
  threshold_x_quantized: 1943650514
  threshold_x_quantized: 1221273173
  threshold_x_quantized: 1125372616
  threshold_x_quantized: 1431721560
  threshold_x_quantized: 1187652589
  threshold_x_quantized: 1411699291
  threshold_x_quantized: 1160051408
  threshold_x_quantized: 1219651036
  threshold_x_quantized: 1391898324
  threshold_x_quantized: 1521774870
  threshold_x_quantized: 1640119808
  threshold_x_quantized: 2033896902
  threshold_x_quantized: 1328321709
  threshold_x_quantized: 1280146406
  threshold_x_quantized: 1928316462
  threshold_x_quantized: 1335152320
  threshold_x_quantized: 1913494383
  threshold_x_quantized: 1264920057
  threshold_x_quantized: 1608832871
  threshold_x_quantized: 1132371662
  threshold_x_quantized: 1457005663
  threshold_x_quantized: 1693151411
  threshold_x_quantized: 1758957201
  threshold_x_quantized: 1725010280
  threshold_x_quantized: 1396970591
  threshold_x_quantized: 1705235572
  threshold_x_quantized: 1145626929
  threshold_x_quantized: 1548045567
  threshold_x_quantized: 1197792910
  threshold_x_quantized: 1705328952
  threshold_x_quantized: 1718478623
  threshold_x_quantized: 1591582502
  threshold_x_quantized: 1321977654
  threshold_x_quantized: 1350907633
  threshold_x_quantized: 1347071347
  threshold_x_quantized: 1106871451
  threshold_x_quantized: 1238230064
  threshold_x_quantized: 1257538576
  threshold_x_quantized: 1879985855
  threshold_x_quantized: 1418183345
  threshold_x_quantized: 2089167649
  threshold_x_quantized: 1771459815
  threshold_x_quantized: 1659101000
  threshold_x_quantized: 1440482110
  threshold_x_quantized: 1672209950
  threshold_x_quantized: 1197977984
  threshold_x_quantized: 2072315933
  threshold_x_quantized: 1554641958
  threshold_x_quantized: 1644888346
  threshold_x_quantized: 1078876180
  threshold_x_quantized: 1855539078
  threshold_x_quantized: 1850450242
  threshold_x_quantized: 1413325921
  threshold_x_quantized: 1533417549
  threshold_x_quantized: 1656438488
  threshold_x_quantized: 1222158102
  threshold_x_quantized: 1352729027
  threshold_x_quantized: 1946446004
  threshold_x_quantized: 1102684114
  threshold_x_quantized: 1440591357
  threshold_x_quantized: 1338552882
  threshold_x_quantized: 1150833087
  threshold_x_quantized: 1172692196
  threshold_x_quantized: 1879504915
  threshold_x_quantized: 2024033490
  threshold_x_quantized: 1323198188
  threshold_x_quantized: 2131008305
  threshold_x_quantized: 1852580139
  threshold_x_quantized: 1263276014
  threshold_x_quantized: 1488428667
  threshold_x_quantized: 1559853241
  threshold_x_quantized: 1095622089
  threshold_x_quantized: 1723169649
  threshold_x_quantized: 1729568468
  threshold_x_quantized: 1440816030
  threshold_x_quantized: 1571002764
  threshold_x_quantized: 1480988631
  threshold_x_quantized: 1986712406
  threshold_x_quantized: 1837735171
  threshold_x_quantized: 1791567319
  threshold_x_quantized: 1550875601
  threshold_x_quantized: 1391466953
  threshold_x_quantized: 1561029683
  threshold_x_quantized: 1726381486
  threshold_x_quantized: 2142384326
  threshold_x_quantized: 1876161785
  threshold_x_quantized: 1853788457
  threshold_x_quantized: 1077607692
  threshold_x_quantized: 1156947695
  threshold_x_quantized: 1132577939
  threshold_x_quantized: 1995261764
  threshold_x_quantized: 2006207116
  threshold_x_quantized: 1484364900
  threshold_x_quantized: 1271000542
  threshold_x_quantized: 1591688660
  threshold_x_quantized: 1815704188
  threshold_x_quantized: 1761143828
  threshold_x_quantized: 1999852249
  threshold_x_quantized: 1156403776
  threshold_x_quantized: 1086349847
  threshold_x_quantized: 2020480432
  threshold_x_quantized: 1633983716
  threshold_x_quantized: 1358420127
  threshold_x_quantized: 1200781619
  threshold_x_quantized: 2120064638
  threshold_x_quantized: 1899011419
  threshold_x_quantized: 1617090436
  threshold_x_quantized: 1301881804
  threshold_x_quantized: 1157913156
  threshold_x_quantized: 1302911788
  threshold_x_quantized: 1576928366
  threshold_x_quantized: 1409476435
  threshold_x_quantized: 1095535660
  threshold_x_quantized: 1228586690
  threshold_x_quantized: 1102089222
  threshold_x_quantized: 1289434797
  threshold_x_quantized: 1604781882
  threshold_x_quantized: 1348023959
  threshold_x_quantized: 1164356207
  threshold_x_quantized: 1150483159
  threshold_x_quantized: 1294566181
  blob_param {
    name: "stage1_unit1_conv3"
    threshold_y: 4.23939180374
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 5
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 5
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 9
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 5
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 6
  right_shift_array: 6
  right_shift_array: 6
}
layer {
  name: "plus0"
  threshold_y: 5.74844455719
  right_shift_width: 7
  threshold_x_quantized: 94
  threshold_x_quantized: 113
  blob_param {
    name: "plus0"
    threshold_y: 5.74844455719
  }
  bottom_unsigned: false
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "stage1_unit2_bn1_scale"
  threshold_y: 16.688243866
  right_shift_width: 6
  blob_param {
    name: "stage1_unit2_bn1"
    threshold_y: 16.688243866
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "stage1_unit2_relu1"
  threshold_y: 16.688243866
  blob_param {
    name: "stage1_unit2_bn1"
    threshold_y: 16.688243866
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "stage1_unit2_conv1"
  threshold_y: 37.0580482483
  threshold_x_quantized: 1621200893
  threshold_x_quantized: 1501348918
  threshold_x_quantized: 1123092474
  threshold_x_quantized: 1884080101
  threshold_x_quantized: 1431109648
  threshold_x_quantized: 1310524353
  threshold_x_quantized: 1329046646
  threshold_x_quantized: 1868687877
  threshold_x_quantized: 1497077656
  threshold_x_quantized: 2133660408
  threshold_x_quantized: 1741914382
  threshold_x_quantized: 1255528245
  threshold_x_quantized: 1803239453
  threshold_x_quantized: 1228598655
  threshold_x_quantized: 1177443800
  threshold_x_quantized: 1086049387
  threshold_x_quantized: 1412816885
  threshold_x_quantized: 1246593524
  threshold_x_quantized: 2133368279
  threshold_x_quantized: 1076090255
  threshold_x_quantized: 1152468500
  threshold_x_quantized: 1570137458
  threshold_x_quantized: 1172456165
  threshold_x_quantized: 1124141210
  threshold_x_quantized: 1303749704
  threshold_x_quantized: 2003599828
  threshold_x_quantized: 1674142299
  threshold_x_quantized: 1869332544
  threshold_x_quantized: 1122892226
  threshold_x_quantized: 1450103797
  threshold_x_quantized: 1463145039
  threshold_x_quantized: 1395012464
  threshold_x_quantized: 1271297793
  threshold_x_quantized: 1494446535
  threshold_x_quantized: 1904739524
  threshold_x_quantized: 1237885221
  threshold_x_quantized: 1201803716
  threshold_x_quantized: 1498051688
  threshold_x_quantized: 1681073734
  threshold_x_quantized: 1623965858
  threshold_x_quantized: 1190381172
  threshold_x_quantized: 1076002524
  threshold_x_quantized: 1559461723
  threshold_x_quantized: 1611766763
  threshold_x_quantized: 1132014628
  threshold_x_quantized: 1790328366
  threshold_x_quantized: 1604368890
  threshold_x_quantized: 1127977738
  threshold_x_quantized: 1896756817
  threshold_x_quantized: 1245061058
  threshold_x_quantized: 1155219286
  threshold_x_quantized: 1842843107
  threshold_x_quantized: 1345419474
  threshold_x_quantized: 1166700393
  threshold_x_quantized: 1458620268
  threshold_x_quantized: 1410278222
  threshold_x_quantized: 1251249950
  threshold_x_quantized: 1465084688
  threshold_x_quantized: 1859786935
  threshold_x_quantized: 2084280923
  threshold_x_quantized: 1913278706
  threshold_x_quantized: 1434344509
  threshold_x_quantized: 2067104568
  threshold_x_quantized: 1234282143
  blob_param {
    name: "stage1_unit2_bn2"
    threshold_y: 37.0580482483
  }
  bottom_unsigned: false
  top_unsigned: false
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 6
  right_shift_array: 8
  right_shift_array: 8
  right_shift_array: 7
  right_shift_array: 8
  right_shift_array: 9
  right_shift_array: 7
}
layer {
  name: "stage1_unit2_relu2"
  threshold_y: 37.0580482483
  blob_param {
    name: "stage1_unit2_bn2"
    threshold_y: 37.0580482483
  }
  bottom_unsigned: false
  top_unsigned: false
}
layer {
  name: "stage1_unit2_conv2"
  threshold_y: 52.5358009338
  threshold_x_quantized: 1966208014
  threshold_x_quantized: 1137272753
  threshold_x_quantized: 1600985260
  threshold_x_quantized: 1255856339
  threshold_x_quantized: 1399491553
  threshold_x_quantized: 2137395786
  threshold_x_quantized: 1852177276
  threshold_x_quantized: 1095767311
  threshold_x_quantized: 1272242796
  threshold_x_quantized: 1164364834
  threshold_x_quantized: 1177334647
  threshold_x_quantized: 1655947897
  threshold_x_quantized: 2067953966
  threshold_x_quantized: 1764883239
  threshold_x_quantized: 1870012699
  threshold_x_quantized: 1622991515
  threshold_x_quantized: 1676272240
  threshold_x_quantized: 1292498880
  threshold_x_quantized: 1782267576
  threshold_x_quantized: 1774477399
  threshold_x_quantized: 1212337712
  threshold_x_quantized: 2018493208
  threshold_x_quantized: 1198418054
  threshold_x_quantized: 1242608163
  threshold_x_quantized: 1314309207
  threshold_x_quantized: 1084358062
  threshold_x_quantized: 1453668492
